Конфигурация отчетов/Catalogs/СистемныеПоставщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СистемныеПоставщики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Catalogs/СистемныеПоставщики/Ext/ManagerModule.bsl
Функция ПолучитьСистемногоПоставщика(Заведение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СистемныеПоставщики.Заведение КАК Заведение,
		|	СистемныеПоставщики.Поставщик КАК Поставщик
		|ИЗ
		|	Справочник.СистемныеПоставщики КАК СистемныеПоставщики
		|ГДЕ
		|	СистемныеПоставщики.Заведение = &Заведение";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Поставщик;

КонецФункции // ПолучитьСистемногоПоставщика()
